In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [8]:
# create a DatetimeIndex
dates = pd.date_range('1/1/2022', periods=8)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08'],
              dtype='datetime64[ns]', freq='D')

In [9]:
# add a DatetimeIndex to a Series
s = pd.Series(np.random.randn(len(dates)), index=dates)
s

2022-01-01   -0.241252
2022-01-02   -1.297437
2022-01-03    1.166502
2022-01-04    0.711168
2022-01-05   -0.516190
2022-01-06   -0.815823
2022-01-07   -0.090346
2022-01-08    0.460490
Freq: D, dtype: float64

In [ ]:
dt

In [11]:
#### add a DatetimeIndex to a DataFrame
df = pd.DataFrame(np.random.randn(len(dates), 2), index=dates, columns=list('AB'))
df

                   A         B
2022-01-01  0.577218  0.574094
2022-01-02 -0.961171 -0.979266
2022-01-03  0.621468 -0.777901
2022-01-04  0.058061  0.666196
2022-01-05  0.578321 -0.634811
2022-01-06 -1.611087  0.629891
2022-01-07  0.145123 -1.125823
2022-01-08  1.702784 -0.191350

In [7]:

# different ways to create a DatetimeIndex
pd.date_range('1/1/2000', periods=8, freq='W-WED')

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23'],
              dtype='datetime64[ns]', freq='W-WED')

In [9]:
pd.date_range('1/1/2000', periods=8, freq='M')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31'],
              dtype='datetime64[ns]', freq='M')

In [10]:
pd.date_range('1/1/2000', periods=8, freq='2M')

DatetimeIndex(['2000-01-31', '2000-03-31', '2000-05-31', '2000-07-31',
               '2000-09-30', '2000-11-30', '2001-01-31', '2001-03-31'],
              dtype='datetime64[ns]', freq='2M')

In [11]:
pd.date_range('1/1/2000', periods=8, freq='D')

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [12]:
# pandas datetime provides a set of useful methods
# to convert between datetime objects and other formats
# such as string, integer, and floating point numbers

# provide format argument to datetime pandas methods
# to convert to string
print(dates.strftime('%Y-%m-%d'))

# working with epoch timestamps
# epoch timestamps are the number of seconds since
# 1/1/1970 00:00:00 UTC
print(pd.to_datetime(1435708800))
print(pd.to_datetime(1435708800, unit='s'))
print(pd.to_datetime(1435708800, unit='ms'))
print(pd.to_datetime(1435708800, unit='us'))
print(pd.DatetimeIndex(['2015-01-01', '2015-01-02']))

Index(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04', '2000-01-05',
       '2000-01-06', '2000-01-07', '2000-01-08'],
      dtype='object')
1970-01-01 00:00:01.435708800
2015-07-01 00:00:00
1970-01-17 14:48:28.800000
1970-01-01 00:23:55.708800
DatetimeIndex(['2015-01-01', '2015-01-02'], dtype='datetime64[ns]', freq=None)

In [13]:
# pandas working with date offsets
# pandas provides a set of useful date offset objects
# that can be used to shift dates
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5),
                    columns=list('ABC'))
df.shift(2)

                   A         B         C
2000-01-01       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN
2000-01-03 -1.360790  0.442555  0.529945
2000-01-04  0.485379  1.210302 -0.561489
2000-01-05  0.656664  0.468596  1.203931

In [14]:
df.shift(-2)

                   A         B         C
2000-01-01  0.656664  0.468596  1.203931
2000-01-02 -0.669079 -1.093619 -0.862255
2000-01-03 -0.917183 -1.866447  0.600705
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN

In [22]:
# pandas tseries provide a set of useful date offset objects
# that can be used to shift dates
ts = pd.Series(np.random.randn(5),
                index=pd.date_range('1/1/2000', periods=5)) 
ts

2000-01-01   -0.355340
2000-01-02   -1.047605
2000-01-03    0.561214
2000-01-04   -0.168478
2000-01-05   -1.539181
Freq: D, dtype: float64

In [24]:
ts = pd.Timestamp('1/1/2000')
ts

Timestamp('2000-01-01 00:00:00')

In [25]:
ts + pd.DateOffset(years=1)

Timestamp('2001-01-01 00:00:00')

In [26]:
ts + pd.DateOffset(months=1)

Timestamp('2000-02-01 00:00:00')

In [27]:
ts + pd.DateOffset(days=1)

Timestamp('2000-01-02 00:00:00')

In [31]:
# converting datetime with timezones 
# pandas provides a set of useful date offset objects
# that can be used to shift dates
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5), 
                    columns=list('ABC'))
df

                   A         B         C
2000-01-01 -0.881539  0.054883  0.212484
2000-01-02  1.168337  0.062938 -1.629524
2000-01-03 -0.983221  0.984422  1.386987
2000-01-04  0.191913  0.385675 -0.108028
2000-01-05  0.429918 -0.790395  0.783589

In [33]:
df.index = df.index.tz_localize('UTC')
df

                                  A         B         C
2000-01-01 00:00:00+00:00 -0.881539  0.054883  0.212484
2000-01-02 00:00:00+00:00  1.168337  0.062938 -1.629524
2000-01-03 00:00:00+00:00 -0.983221  0.984422  1.386987
2000-01-04 00:00:00+00:00  0.191913  0.385675 -0.108028
2000-01-05 00:00:00+00:00  0.429918 -0.790395  0.783589

In [34]:
df.index = df.index.tz_convert('US/Eastern')
df

                                  A         B         C
1999-12-31 19:00:00-05:00 -0.881539  0.054883  0.212484
2000-01-01 19:00:00-05:00  1.168337  0.062938 -1.629524
2000-01-02 19:00:00-05:00 -0.983221  0.984422  1.386987
2000-01-03 19:00:00-05:00  0.191913  0.385675 -0.108028
2000-01-04 19:00:00-05:00  0.429918 -0.790395  0.783589

In [53]:
# working with pandas Timedeltas
# pandas provides a set of useful date offset objects
# that can be used to shift dates
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5), 
                    columns=list('ABC'))
df

                   A         B         C
2000-01-01  0.639048 -1.438277  1.145599
2000-01-02 -0.085662 -0.362288  0.592768
2000-01-03  1.129465  0.453388 -0.947451
2000-01-04  0.796962  0.308374 -0.576878
2000-01-05 -0.023470  0.563939 -0.290120

In [57]:
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5), 
                    columns=list('ABC'))
df.index = df.index + pd.Timedelta('1D')
df

                   A         B         C
2000-01-02 -0.287790  0.352394 -0.529738
2000-01-03  0.613917 -1.745413 -0.893117
2000-01-04  1.540391  0.548363  0.887438
2000-01-05 -2.284608  0.609229 -0.381917
2000-01-06 -0.311641  0.698319 -2.241893

In [58]:
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5), 
                    columns=list('ABC'))
df.index = df.index + pd.Timedelta('1M')
df

/Users/tarekatwan/opt/anaconda3/envs/ch2/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3441: FutureWarning: Units 'M', 'Y' and 'y' do not represent unambiguous timedelta values and will be removed in a future version
  exec(code_obj, self.user_global_ns, self.user_ns)

                            A         B         C
2000-01-01 00:01:00 -0.482748  1.013951  0.583748
2000-01-02 00:01:00  1.886442  0.333283 -0.740861
2000-01-03 00:01:00  0.677807 -0.641988  1.002036
2000-01-04 00:01:00  1.267553  1.847034 -0.271128
2000-01-05 00:01:00  1.020461 -1.289208 -0.464363

In [59]:
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5), 
                    columns=list('ABC'))
df.index = df.index + pd.Timedelta('1Y')
df

/Users/tarekatwan/opt/anaconda3/envs/ch2/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3441: FutureWarning: Units 'M', 'Y' and 'y' do not represent unambiguous timedelta values and will be removed in a future version
  exec(code_obj, self.user_global_ns, self.user_ns)

                            A         B         C
2000-12-31 05:49:12  1.546858  0.673423  1.967957
2001-01-01 05:49:12 -1.244144 -0.396621  1.855365
2001-01-02 05:49:12  0.348491 -0.920623 -0.355932
2001-01-03 05:49:12  0.461435  0.645211  0.317498
2001-01-04 05:49:12  0.103829 -0.226290 -0.612670

In [60]:
# working with date and time frequencies
# pandas provides a set of useful date offset objects
# that can be used to shift dates
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5),
                    columns=list('ABC'))
df

                   A         B         C
2000-01-01  0.943858 -0.249067 -1.324645
2000-01-02  0.766300 -0.069155 -0.041424
2000-01-03 -0.661424 -0.591794  0.384762
2000-01-04  0.036827  0.585415  0.405477
2000-01-05  0.163572 -0.065812 -1.169103

In [61]:
df.resample('D')

In [66]:
# Adding custom business days
# pandas provides a set of useful date offset objects
# that can be used to shift dates
df = pd.DataFrame(np.random.randn(5, 3),
                    index=pd.date_range('1/1/2000', periods=5),
                    columns=list('ABC'))
df

                   A         B         C
2000-01-01 -0.256271  0.354690  0.364681
2000-01-02  1.578034  0.427724  0.683645
2000-01-03  0.325317 -1.746206 -1.656321
2000-01-04  0.592429 -0.411040 -0.400027
2000-01-05  0.119811  0.581237 -0.052405

In [67]:
df.index = df.index + pd.offsets.CustomBusinessDay(2)
df

/Users/tarekatwan/opt/anaconda3/envs/ch2/lib/python3.9/site-packages/pandas/core/arrays/datetimes.py:741: PerformanceWarning: Non-vectorized DateOffset being applied to Series or DatetimeIndex
  warnings.warn(

                   A         B         C
2000-01-04 -0.256271  0.354690  0.364681
2000-01-04  1.578034  0.427724  0.683645
2000-01-05  0.325317 -1.746206 -1.656321
2000-01-06  0.592429 -0.411040 -0.400027
2000-01-07  0.119811  0.581237 -0.052405